In [81]:
# Importing the libraries
from __future__ import absolute_import, division, print_function, unicode_literals
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.model_selection import train_test_split
import tensorflow as tf
from tensorflow import keras
from sklearn.tree import DecisionTreeClassifier

In [34]:
# Importing the dataset
dataset = pd.read_csv('Churn_Modelling.csv')

In [35]:
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [36]:
dataset.groupby(['Exited']).count()[['RowNumber']]

        RowNumber
Exited
0            7963
1            2037

In [37]:
dataset.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [38]:
X = dataset[['CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary']]

In [39]:
Y = dataset[['Exited']]

In [40]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [43]:
X = pd.get_dummies(X, columns = ['Geography','Gender'])

In [44]:
X.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,1,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,1,0
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,1,0
3,699,39,1,0.00,2,0,0,93826.63,1,0,0,1,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,1,0

In [45]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.3, random_state=541) # 70% training and 30% test

In [75]:
lista = []
X = X_train.reset_index(drop = True)
for i in range(len(X)):
    a = len(X)-i
    if a % 1000 == 0:
        print(a)
    lista.append(np.array(X[i:i+1].values))
lista = np.array(lista)
lista.shape

7000
6000
5000
4000
3000
2000
1000

(7000, 1, 13)

In [82]:
# Create Decision Tree classifer object
clf = DecisionTreeClassifier()

# Train Decision Tree Classifer
clf = clf.fit(X_train,y_train)

#Predict the response for test dataset
y_pred = clf.predict(X_test)

In [90]:
len(y_pred)

3000

In [96]:
tot = len(y_pred)
mat = sum(np.array(list(y_test['Exited'])) == y_pred)

In [97]:
mat/tot

0.8026666666666666

In [101]:
result = pd.DataFrame()
result['real'] = np.array(list(y_test['Exited']))
result['pred'] = y_pred
result.head(100)

    real  pred
0      0     0
1      1     0
2      0     0
3      0     0
4      0     0
..   ...   ...
95     0     0
96     1     1
97     0     0
98     0     0
99     0     0

[100 rows x 2 columns]

In [111]:
a = len(result[(result['real'] == 1) & (result['pred'] == 1)])/len(result[(result['real'] == 1)])
b = len(result[(result['real'] == 0) & (result['pred'] == 0)])/len(result[(result['real'] == 0)])

In [113]:
a, b

(0.535, 0.8695833333333334)